Revit 2024 API
UIDocument Constructor
 Use a database level Document to construct a UI-level Document.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public UIDocument(
	Document document
)
Visual Basic
Public Sub New ( _
	document As Document _
)
Visual C++
public:
UIDocument(
	Document^ document
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The database level document.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  document is not a primary document, it is a linked document.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
UIDocument Class
Autodesk.Revit.UI Namespace